app/controllers/user_controller.rb

SELECT DISTINCT "users".* FROM "users" ORDER BY "users"."follows" DESC
---
  def index
    @users = User.all.uniq.order(follows: :desc)